app/controllers/application_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def cronofy_client(user = nil)
    client_id =     Rails.application.credentials[:cronofy][:client_id]
    client_secret = Rails.application.credentials[:cronofy][:client_secret]
    if user
      Cronofy::Client.new(
        client_id: client_id,
        client_secret: client_secret,
        access_token: User.first.access_token,
        refresh_token: User.first.refresh_token
      )

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."refresh_token" = ? LIMIT ?  [["refresh_token", "n__CTR6BBk15AADt3J1ApYl_QGK2DO8Y"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."refresh_token" = ? LIMIT ?  [["refresh_token", "n__CTR6BBk15AADt3J1ApYl_QGK2DO8Y"], ["LIMIT", 1]]
UPDATE "users" SET "access_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["access_token", "gJ2kEfO5OuWJKLOOLuX-qkYzEZsGvfSQ"], ["updated_at", "2021-01-25 10:55:43.916311"], ["id", 1]]
---
  def refresh_access_token
    client_id =     Rails.application.credentials[:cronofy][:client_id]
    client_secret = Rails.application.credentials[:cronofy][:client_secret]

    @user = User.first

    @cronofy = cronofy_client(@user)

    response = @cronofy.refresh_access_token

    if User.where(refresh_token: response.refresh_token).exists?
      user = User.find_by(refresh_token: response.refresh_token)
      user.update(access_token: response.access_token)