app/controllers/calendars_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def preload_cronofy
    @user = User.first
    @cronofy = cronofy_client(User.first)