app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."account_id" = ? LIMIT ?  [["account_id", "acc_5ff47dfa49fa7100c1a8bbfc"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."account_id" = ? LIMIT ?  [["account_id", "acc_5ff47dfa49fa7100c1a8bbfc"], ["LIMIT", 1]]
UPDATE "users" SET "access_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["access_token", "GD8fCxZXUpxeEPXsukSnW6pRVQTFwvKN"], ["updated_at", "2021-01-13 13:18:34.481034"], ["id", 1]]
INSERT INTO "users" ("account_id", "access_token", "refresh_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def index
        client_id =     Rails.application.credentials[:cronofy][:client_id]
        client_secret = Rails.application.credentials[:cronofy][:client_secret]

        @cronofy = Cronofy::Client.new(
            client_id:     client_id,
            client_secret: client_secret,
        )

        code = [params[:code]]
        response = @cronofy.get_token_from_code(code, 'http://localhost:3000/oauth2/callback')

        if User.where(account_id: response.account_id).exists?
            user = User.find_by(account_id: response.account_id)
            user.update(access_token: response.access_token, refresh_token: response.refresh_token)
            user.save

        else
            user = User.create(account_id: response.account_id, access_token: response.access_token, refresh_token: response.refresh_token)