app/controllers/users_controller.rb

    def index
        if User.first
            @cronofy = cronofy_client(User.first)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]